<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>supportplan.Adobe Dimension 2023 Import</string>
	<key>Input</key>
	<dict>
		<key>MINIMUM_OS_VERSION</key>
		<string>11.0.0</string>
		<key>MUNKI_CATEGORY</key>
		<string>AdobeCC</string>
		<key>MUNKI_DESCRIPTION</key>
		<string>Adobe Dimension (formerly Project Felix) is a 3D rendering and design software.</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Adobe</string>
		<key>MUNKI_NAME</key>
		<string>Adobe Dimension 2023</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>custom/%MUNKI_DEVELOPER%/%NAME%</string>
		<key>NAME</key>
		<string>AdobeDimension2023</string>
		<key>force_munkiimport</key>
		<true/>
		<key>pkginfo</key>
		<dict>
			<key>RestartAction</key>
			<string>RequireLogout</string>
			<key>catalogs</key>
			<array>
				<string>custom</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>%MUNKI_DESCRIPTION%</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>name</key>
			<string>%MUNKI_NAME%</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<true/>
			<key>installcheck_script</key>
			<string>#!/bin/bash

AN=Dimension
VN=
PV=ESHR

AL=/Applications/Adobe\ $AN/Adobe\ $AN.app/Contents/Info.plist

if [ -f "$AL" ]; then
  CV=$(/usr/libexec/PlistBuddy -c "Print :CFBuildNumber" "$AL")
	if [[ "$CV" &lt; "$VN" ]]; then
		if /usr/local/bin/RemoteUpdateManager --productVersions=$PV; then
			exit 1
			else
				exit 1
				fi
				else
					exit 1
					fi
					else
						exit 0
					fi</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
				if [ -f /Library/Scripts/SupportPlan/AdobeAppsOn ]; then
					echo "&lt;config&gt;&lt;panel&gt;&lt;name&gt;AppsPanel&lt;/name&gt;&lt;visible&gt;true&lt;/visible&gt;&lt;/panel&gt;&lt;feature&gt;&lt;name&gt;SelfServeInstalls&lt;/name&gt;&lt;enabled&gt;true&lt;/enabled&gt;&lt;/feature&gt;&lt;/config&gt;" &gt; /Library/Application\ Support/Adobe/OOBE/Configs/ServiceConfig.xml
				fi</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.Import Adobe 2023 Title</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>Adobe2023Versioner</key>
			<dict>
				<key>path</key>
				<string>/Users/Shared/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Adobe 2023/Adobe2023Versioner.py</string>
				<key>sha256_hash</key>
				<string>8b0a6deb174c845a117bffb099c07f47e17a461d0b707541411885be82a7040d</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.munki.Import Adobe 2023 Title</key>
			<dict>
				<key>git_hash</key>
				<string>28e094996f960a84e41821162cade06d7a8e67bc</string>
				<key>path</key>
				<string>/Users/Shared/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Adobe 2023/Adobe 2023 Import.munki.recipe</string>
				<key>sha256_hash</key>
				<string>4f1547579470625de46411385ddbdce276c69ccba3d791275642b345dc55799c</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
