<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>supportplan.Adobe Photoshop 2022 Import</string>
	<key>Input</key>
	<dict>
		<key>MINIMUM_OS_VERSION</key>
		<string>10.15.0</string>
		<key>MUNKI_CATEGORY</key>
		<string>AdobeCC</string>
		<key>MUNKI_DESCRIPTION</key>
		<string>Some description.</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Adobe</string>
		<key>MUNKI_NAME</key>
		<string>SomeAdobe2022Title</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
		<key>NAME</key>
		<string>SomeAdobe2022Title - must match package name</string>
		<key>force_munkiimport</key>
		<true/>
		<key>pkginfo</key>
		<dict>
			<key>RestartAction</key>
			<string>RequireLogout</string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>%MUNKI_DESCRIPTION%</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>name</key>
			<string>%MUNKI_NAME%</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.Import Adobe 2022 Title</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>Adobe2022Versioner</key>
			<dict>
				<key>git_hash</key>
				<string>933890e4d41102f8ba581a19ca0591eb33ceb8ae</string>
				<key>path</key>
				<string>/Users/Shared/AutoPkg/RecipeRepos/com.github.SupportPlan.dataJAR-recipes/Adobe 2022/Adobe2022Versioner.py</string>
				<key>sha256_hash</key>
				<string>114dd9f0567fa6b46e91da1283ddee293e594e7d8d567f8dd77b65d79109ec9a</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.munki.Import Adobe 2022 Title</key>
			<dict>
				<key>git_hash</key>
				<string>e7f733b449f39438590b39163b7d2c566d806e76</string>
				<key>path</key>
				<string>/Users/Shared/AutoPkg/RecipeRepos/com.github.SupportPlan.dataJAR-recipes/Adobe 2022/Adobe 2022 Import.munki.recipe</string>
				<key>sha256_hash</key>
				<string>dc6a13b4dee58cc95712facde4c6f96663935b7dff16d4a04d571dab6dccbe66</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
